Q1. List any five functions of the pandas library with execution.

Read a file-> We can read data in pandas data frame as read_csv().

Head/tail -> To display records of first few use Head & last few we use tail

info()/dtypes  -> Tells information/data type of column of dataframe

.min.max.sum  -> To displaymin/max/sum of column

pd.set_option  -> Alter display with repect to column/row or sizes of single block to display

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [5]:
import pandas as pd
df_Q2 = pd.DataFrame({'A':[1,2,3,4,5],
                     'B' :[5,10,15,20,25],
                     'C' :['A','AB','ABC','ABCD','ABCDE']})
df_Q2.reindex([1,3,5,7,9])

     A     B     C
1  2.0  10.0    AB
3  4.0  20.0  ABCD
5  NaN   NaN   NaN
7  NaN   NaN   NaN
9  NaN   NaN   NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [6]:
df_Q3 = pd.DataFrame({'Values':[10,20,30,40,50]})
print(sum(df_Q3['Values'][0:3]))

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [26]:
#df_Q4 = pd.DataFrame({'Text': ['As per early estimates, the film earned Rs 72.50 crore in India on the third day. Thus, the total collection of Animal now stands at Rs 202.57 crore. Meanwhile, Animal had an overall 79.05 per cent Hindi occupancy on Sunday, December 3. The Hindi screenings contributed Rs 64.80 crore alone The story delves into the tumultuous relationship between a father and son. When Ranvijay learns about an assassination attempt on his father Balbir Singh, he sets out to exact revenge. The film also features Anil Kapoor, Rashmika Mandanna, Tripti Dimri and Bobby Deol in significant roles']})
#df_Q4['Word_Count'] = df_Q4['Text'].apply(lambda x: len(x.split()))

In [29]:
df_Q4 = pd.DataFrame({'Text': ['As per early estimates, the film earned Rs 72.50 crore in India on the third day. Thus, the total collection of Animal now stands at Rs 202.57 crore. Meanwhile, Animal had an overall 79.05 per cent Hindi occupancy on Sunday, December 3. The Hindi screenings contributed Rs 64.80 crore alone', 'The story delves into the tumultuous relationship between a father and son. When Ranvijay learns about an assassination attempt on his father Balbir Singh, he sets out to exact revenge. The film also features Anil Kapoor, Rashmika Mandanna, Tripti Dimri and Bobby Deol in significant roles']})

def word_count(x):
    c = x.split()
    l = len(c)
    return l
df_Q4['Word_Count'] = df_Q4['Text'].apply(word_count)
df_Q4

                                                Text  Word_Count
0  As per early estimates, the film earned Rs 72....          50
1  The story delves into the tumultuous relations...          46

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() Returns size of dataframe/series which is equivalent to total number of elements
DataFrame.shape() returns r*c form where r is no of records,c is no of attribute

In [32]:
df_Q4.shape

(2, 2)

In [33]:
df_Q4.size

4

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel('Filename')

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [51]:
df_Q7 = pd.DataFrame({'Email':['username@domain.com','kirtiprakash9@gmail.com']})
df_Q7['Username'] = df_Q7['Email'].str.split('@').str[0]
df_Q7

                     Email       Username
0      username@domain.com       username
1  kirtiprakash9@gmail.com  kirtiprakash9

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [32]:
import pandas as pd
df_Q8 = pd.DataFrame({'A':[2,34,4,6,87,6,1,90],
                     'B':[5,3,7,4,9,12,15,67],
                     'C':[1,2,3,4,5,6,7,8]})
df = df_Q8[(df_Q8['A']>5) & (df_Q8['B']<10)]
df

    A  B  C
1  34  3  2
3   6  4  4
4  87  9  5

In [38]:
import pandas as pd

df_Q8 = pd.DataFrame({'A': [2, 34, 4, 6, 87, 6, 1, 90],
                      'B': [5, 3, 7, 4, 9, 12, 15, 67],
                      'C': [1, 2, 3, 4, 5, 6, 7, 8]})

def funQ8(row):
    a, b, c = row['A'], row['B'], row['C']
    if a > 5 and b < 10:
        return a, b, c
    else:
        return None

res = df_Q8.apply(funQ8, axis=1)
res = res.dropna().apply(pd.Series)

print(res)

    0  1  2
1  34  3  2
3   6  4  4
4  87  9  5

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [4]:
import pandas as pd
df = pd.DataFrame({'Values':[1,11,2,32,12,67,22]})
print(df.mean())
print(df.median())
print(df.std())

Values    21.0
dtype: float64
Values    12.0
dtype: float64
Values    23.021729
dtype: float64

In [22]:
import pandas as pd
import numpy as np
import statistics as st
df = pd.DataFrame({'Values':[1,11,2,32,12,67,22]})
def func(val):
    m = np.mean(val)
    n = np.median(val)
    s = st.stdev(val)
    return m,n,s
df.apply(func,axis=0)

      Values
0  21.000000
1  12.000000
2  23.021729

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [39]:
Sales = [100,120,110,234,332,564,45,33,234,765,44,214]
date = pd.date_range(start = '02-02-2023',end = '13-02-2023')
df = pd.DataFrame({'Sales': Sales, 'Date':date})
df_res = df.rolling(window=7).mean()
df_res

/tmp/ipykernel_78/3362249612.py:2: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  date = pd.date_range(start = '02-02-2023',end = '13-02-2023')
/tmp/ipykernel_78/3362249612.py:4: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df_res = df.rolling(window=7).mean()

         Sales
0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6   215.000000
7   205.428571
8   221.714286
9   315.285714
10  288.142857
11  271.285714

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [54]:
#Date = pd.to_daterange(start = '01-12-2023',end = '10-12-2023')
Date= pd.date_range(start = '12-01-2023',end = '12-12-2023')
df = pd.DataFrame({'DATE':Date})
df['Weekday'] = df['DATE'].dt.day_name()

In [55]:
df

         DATE    Weekday
0  2023-12-01     Friday
1  2023-12-02   Saturday
2  2023-12-03     Sunday
3  2023-12-04     Monday
4  2023-12-05    Tuesday
5  2023-12-06  Wednesday
6  2023-12-07   Thursday
7  2023-12-08     Friday
8  2023-12-09   Saturday
9  2023-12-10     Sunday
10 2023-12-11     Monday
11 2023-12-12    Tuesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [64]:
Date = pd.date_range(start = '01-01.2022',end = '12-18-2023')
df = pd.DataFrame({'Date':Date})
m = (df['Date']>'2023-01-01') & (df['Date']<'2023-01-31')
df2 = df.loc[m]
df2

          Date
366 2023-01-02
367 2023-01-03
368 2023-01-04
369 2023-01-05
370 2023-01-06
371 2023-01-07
372 2023-01-08
373 2023-01-09
374 2023-01-10
375 2023-01-11
376 2023-01-12
377 2023-01-13
378 2023-01-14
379 2023-01-15
380 2023-01-16
381 2023-01-17
382 2023-01-18
383 2023-01-19
384 2023-01-20
385 2023-01-21
386 2023-01-22
387 2023-01-23
388 2023-01-24
389 2023-01-25
390 2023-01-26
391 2023-01-27
392 2023-01-28
393 2023-01-29
394 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?
import pandas as pd